IDEA StatiCa Open Model
ImperfectionDirection Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 direction of imperfection
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ImperfectionDirection
Public Enumeration ImperfectionDirection
public enum class ImperfectionDirection
Members
Member name | Value | Description
BothDirections | 0 |  Imperfections are separately added to both directions, y and z.
BiggerSlenderner | 1 |  bigger slenderness direction
MomentResultant | 2 |  resultant of moments
Both | 3 |  both
FromSetup | 4 |  Takes imperfection direction from global code setup. This value must not be used in code setup!
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace